---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.ProblemWithPowerLoadWarn
source: html/35d139bc-2092-b845-1fa1-52e95441972d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.ProblemWithPowerLoadWarn Property

[Room]'s power load is too high. This may be caused by an incorrect density value and must be corrected before this space can be included in the load calculations.

## Syntax (C#)
```csharp
public static FailureDefinitionId ProblemWithPowerLoadWarn { get; }
```